questions = [
    "Как бихте описали настоящото си емоционално състояние?",
    "Колко често през последния месец сте се чувствали щастливи?",
    "Колко често се чувствате стресирани през последните две седмици?",
    "Какви са основните източници на стрес за вас?",
    "Колко често се чувствате безнадеждни или тъжни без конкретна причина?",
    "Забелязали ли сте промени в съня си през последния месец?",
    "Чувствате ли, че имате на кого да разчитате, когато се чувствате зле?",
    "Страхувате ли се от промяна?",
    "Колко често общувате с приятели или семейство?",
    "Как се справяте със стреса?",
    "Как оценявате качеството на съня си?",
    "Бихте ли потърсили професионална помощ, ако се чувствате психически зле?"
]
