from flask_wtf import FlaskForm
from wtforms import RadioField, SubmitField
from wtforms.validators import DataRequired


from flask_wtf import FlaskForm
from wtforms import RadioField, SubmitField
from wtforms.validators import DataRequired

class QuestionnaireForm(FlaskForm):
    question_1 = RadioField('Какво предпочиташ като форма на забавление?',
                             choices=[('a', 'Излизания с приятели'),
                                      ('b', 'Гледане на филми/сериали'),
                                      ('c', 'Игри (видео игри, настолни игри)'),
                                      ('d', 'Занимания с изкуство (рисуване, музика и т.н.)')],
                             validators=[DataRequired()])

    question_2 = RadioField('Какъв тип музика предпочиташ?',
                             choices=[('a', 'Поп и комерсиална музика'),
                                      ('b', 'Рок/метъл'),
                                      ('c', 'Класическа музика'),
                                      ('d', 'Хип-хоп и R&B'),
                                      ('e', 'Електронна музика')],
                             validators=[DataRequired()])

    question_3 = RadioField('Какъв е твоят предпочитан начин за общуване?',
                            choices=[('a', 'Лично'),
                                     ('b', 'По телефон'),
                                     ('c', 'Чрез съобщения')],
                            validators=[DataRequired()])

    question_4 = RadioField('Как се справяш със стреса?',
                            choices=[('a', 'Търся решения и действам веднага'),
                                     ('b', 'Често се чувствам претоварен и отлагам решенията')],
                            validators=[DataRequired()])

    question_5 = RadioField('Как предпочиташ да прекарваш свободното си време?',
                            choices=[('a', 'В група с приятели'),
                                     ('b', 'Сам/а, в тишина и спокойствие')],
                            validators=[DataRequired()])

    question_6 = RadioField('Как оценяваш нови идеи и промени?',
                            choices=[('a', 'Обичам нововъведенията и промените'),
                                     ('b', 'Предпочитам стабилността и традициите')],
                            validators=[DataRequired()])

    question_7 = RadioField('Често ли завързваш нови приятелства?',
                            choices=[('a', 'Да, често'),
                                     ('b', 'Понякога'),
                                     ('c', 'Рядко')],
                            validators=[DataRequired()])

    question_8 = RadioField('Успявате ли да останете хладнокръвни по време на стресови ситуации?',
                            choices=[('a', 'Да'),
                                     ('b', 'Не'),
                                     ('c', 'Горе-долу')],
                            validators=[DataRequired()])

    question_9 = RadioField('Когато сте в групови обстановки какво правите?',
                            choices=[('a', 'Не общувам'),
                                     ('b', 'Общувам само с хората, които познавам'),
                                     ('c', 'Старая се да се опозная с нови хора')],
                            validators=[DataRequired()])

    question_10 = RadioField('Как се чувстваш, когато трябва да вземеш важно решение?',
                             choices=[('a', 'Вземам решение бързо и уверено'),
                                      ('b', 'Обмислям внимателно и отлагам, докато не съм сигурен/на'),
                                      ('c', 'Търся съвет от други хора')],
                             validators=[DataRequired()])

    question_11 = RadioField('Как реагираш на конфликтни ситуации?',
                             choices=[('a', 'Опитвам се да ги реша бързо'),
                                      ('b', 'Избягвам конфликти'),
                                      ('c', 'Разговарям с всички страни и търся компромис')],
                             validators=[DataRequired()])

    question_12 = RadioField('Какво те мотивира най-много?',
                             choices=[('a', 'Успехът и признанието'),
                                      ('b', 'Личното удовлетворение'),
                                      ('c', 'Стабилността и сигурността')],
                             validators=[DataRequired()])

    question_13 = RadioField('Кой от следните типове работа би ти допаднал най-много?',
                             choices=[('a', 'Работа в екип'),
                                      ('b', 'Самостоятелна работа'),
                                      ('c', 'Смесено – малко екипна, малко индивидуална')],
                             validators=[DataRequired()])

    question_14 = RadioField('Как предпочиташ да решаваш проблемите?',
                             choices=[('a', 'С логика и анализ'),
                                      ('b', 'Слушам интуицията си'),
                                      ('c', 'Търся чужди мнения и съвети')],
                             validators=[DataRequired()])

    question_15 = RadioField('Как реагираш, когато нещо не върви по план?',
                             choices=[('a', 'Оставам спокоен/на и намирам друго решение'),
                                      ('b', 'Чувствам се разочарован/а, но се адаптирам'),
                                      ('c', 'Изпитвам стрес и губя мотивация')],
                             validators=[DataRequired()])

    question_16 = RadioField('Какъв е твоят подход към рутината?',
                             choices=[('a', 'Харесвам я, тя ми дава стабилност'),
                                      ('b', 'Не я обичам, предпочитам разнообразие'),
                                      ('c', 'Зависи от ситуацията')],
                             validators=[DataRequired()])

    question_17 = RadioField('Какво правиш в свободното си време?',
                             choices=[('a', 'Спортувам или правя физически активности'),
                                      ('b', 'Чета'),
                                      ('c', 'Рисувам'),
                                      ('d', 'Занимавам се с други интелектуални хобита'),
                                      ('e', 'Пътувам')],
                             validators=[DataRequired()])

    question_18 = RadioField('Какво предпочиташ да правиш през уикендите?',
                             choices=[('a', 'Прекарвам време с приятели и семейство'),
                                      ('b', 'Прекарвам време сам/а, занимавайки се с хобита')],
                             validators=[DataRequired()])

    question_19 = RadioField('Какъв тип книги предпочиташ?',
                             choices=[('a', 'Фантастика и приключенски романи'),
                                      ('b', 'Научна литература и психологически книги'),
                                      ('c', 'Трилъри и мистерии'),
                                      ('d', 'Романтични'),
                                      ('e', 'Никое от изброените')],
                             validators=[DataRequired()])

    question_20 = RadioField('Какво те привлича повече – планината или морето?',
                             choices=[('a', 'Планината'),
                                      ('b', 'Морето'),
                                      ('c', 'Нито едно от двете')],
                             validators=[DataRequired()])

    question_21 = RadioField('Кой жанр филми гледаш най-често?',
                             choices=[('a', 'Екшън и приключенски'),
                                      ('b', 'Драма и романтични'),
                                      ('c', 'Комедия'),
                                      ('d', 'Фантастика и фентъзи'),
                                      ('e', 'Документални и исторически')],
                             validators=[DataRequired()])

    question_22 = RadioField('Какво предпочиташ като форма на забавление?',
                             choices=[('a', 'Излизания с приятели'),
                                      ('b', 'Гледане на филми/сериали'),
                                      ('c', 'Игри (видео игри, настолни игри)'),
                                      ('d', 'Занимания с изкуство (рисуване, музика и т.н.)')],
                             validators=[DataRequired()])

    question_23 = RadioField('Какъв тип музика предпочиташ?',
                             choices=[('a', 'Поп и комерсиална музика'),
                                      ('b', 'Рок/метъл'),
                                      ('c', 'Класическа музика'),
                                      ('d', 'Хип-хоп и R&B'),
                                      ('e', 'Електронна музика')],
                             validators=[DataRequired()])

    submit = SubmitField('Изпрати')

